; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v1 ?v3)
             (pred_3 ?v12 ?v4)
             (pred_1 ?v1 ?v4)
             (pred_5 ?v7 ?v1 )
	     (pred_8 ?v1)
             (pred_4 ?v6)
             (pred_2 ?v12)
             (pred_7 ?v4)
             (pred_10 ?v1)
             (pred_9 ?v12)
             (pred_12 ?v1)
             (pred_6 ))



(:action op_3
:parameters (?v5 ?v10 ?v9 ?v13)
:precondition (and (pred_4 ?v5) (pred_4 ?v10) (pred_2 ?v9) (pred_7 ?v13)
          (pred_11 ?v5 ?v10) (pred_3 ?v9 ?v13)
                   (pred_1 ?v10 ?v13) (pred_8 ?v5) 
                   (pred_10 ?v10) (pred_9 ?v9))
:effect (and  (pred_12 ?v10) (not (pred_10 ?v10))))


(:action op_1
:parameters (?v5 ?v8)
:precondition (and (pred_4 ?v5) (pred_4 ?v8)
               (pred_8 ?v5) (pred_11 ?v5 ?v8) (pred_12 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v5))))

(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_4 ?v5) (pred_2 ?v9) 
                  (pred_8 ?v5) (pred_5 ?v9 ?v5) (pred_6 ))
:effect (and (pred_9 ?v9)
   (not (pred_5 ?v9 ?v5)) (not (pred_6 ))))


(:action op_5
:parameters (?v5 ?v11 ?v2)
:precondition (and (pred_4 ?v5) (pred_2 ?v11) (pred_2 ?v2)
                  (pred_8 ?v5) (pred_9 ?v2) (pred_5 ?v11 ?v5))
:effect (and (pred_9 ?v11) (pred_5 ?v2 ?v5)
        (not (pred_9 ?v2)) (not (pred_5 ?v11 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_4 ?v5) (pred_2 ?v9) 
                  (pred_8 ?v5) (pred_9 ?v9))
:effect (and (pred_6 ) (pred_5 ?v9 ?v5) (not (pred_9 ?v9)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_04 obj_12 obj_09 obj_07 obj_10 obj_05 obj_03 obj_11
    obj_13 obj_01
    obj_02 obj_06
    )

    (:init
       (pred_6)

       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_2 obj_02)
       (pred_2 obj_06)

       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_04 obj_07)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_11)
       (pred_1  obj_04 obj_13)
       (pred_1  obj_11 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_05)
       (pred_12 obj_03)

       (pred_3  obj_02 obj_13)
       (pred_3  obj_06 obj_01)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_06 obj_03)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_5 obj_02 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_1 obj_12 obj_10)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_10)
   goals met: 0 of 1
2. (op_1 obj_10 obj_07)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_07)
   goals met: 0 of 1
3. (op_1 obj_07 obj_03)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_03)
   goals met: 0 of 1
4. (op_1 obj_03 obj_05)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_05)
   goals met: 0 of 1
5. (op_2 obj_05 obj_02)
   deleted: (pred_5 obj_02 obj_05) (pred_6)
   added: (pred_9 obj_02)
   goals met: 0 of 1
6. (op_1 obj_05 obj_03)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_03)
   goals met: 0 of 1
7. (op_1 obj_03 obj_07)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_07)
   goals met: 0 of 1
8. (op_3 obj_07 obj_04 obj_02 obj_13)
   deleted: (pred_10 obj_04)
   added: (pred_12 obj_04)
   goals met: 0 of 1
9. (op_1 obj_07 obj_04)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_04)
   goals met: 0 of 1
10. (op_4 obj_04 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_6) (pred_5 obj_02 obj_04)
   goals met: 1 of 1
